Podkova/src/Catalogs/НастройкиПродажДляПользователей/НастройкиПродажДляПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиПродажДляПользователей</name>
  <owners>Catalog.Пользователи</owners>
  <owners>Catalog.ГруппыПользователей</owners>
  <attributes>
    <name>ОграничиватьРучныеСкидки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУточненияПоЦеновымГруппам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентРучнойНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентРучнойСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РМК_Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РМК_ВозвратТовара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РМК_ВнесениеДенег</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РМК_ВыемкаДенег</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РМК_КорректировкаСтрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РМК_Отложить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РМК_Зарезервировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РМК_ОткрытьСмену</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РМК_ЗакрытьСмену</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РМК_ИзменениеКартЛояльности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РМК_РедактированиеИнформацииОКлиенте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЦеновыеГруппы</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Podkova/src/CommonModules/НастройкиПродажДляПользователейСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Очистить неиспользуемые правила продаж.
//
// Параметры:
//  Объект - СправочникОбъект.НастройкиПродажДляПользователей, СправочникОбъект.СоглашенияСКлиентами - Объект.
//
Процедура ОчиститьНеиспользуемыеПравилаПродаж(Объект) Экспорт
	
	Если Не Объект.ОграничиватьРучныеСкидки Тогда
		Объект.ПроцентРучнойСкидки = 0;
		Объект.ПроцентРучнойНаценки = 0;
		
		Если ТипЗнч(Объект) <> Тип("СправочникОбъект.НастройкиПродажДляПользователей") Тогда
			Для Каждого СтрокаТЧ Из Объект.ЦеновыеГруппы Цикл
				СтрокаТЧ.ПроцентРучнойСкидки  = 0;
				СтрокаТЧ.ПроцентРучнойНаценки = 0;
			КонецЦикла;
		Иначе
			Объект.ЦеновыеГруппы.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Получить ограничения скидок (наценок)
//
// Параметры:
//  СоглашениеСКлиентом - СправочникСсылка.СоглашенияСКлиентами - Соглашение
//  Пользователь - СправочникСсылка.Пользователи - Пользователь.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Ограничений скидок (наценок).
//
Функция ОграниченияСкидокНаценок(СоглашениеСКлиентом = Неопределено, Пользователь) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ИспользоватьРучныеСкидки                     = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах");
	ИспользоватьЦеновыеГруппы                    = ПолучитьФункциональнуюОпцию("ИспользоватьЦеновыеГруппы");
	ИспользоватьОграниченияРучныхСкидокВПродажах = ПолучитьФункциональнуюОпцию("ИспользоватьОграниченияРучныхСкидокВПродажахПоПользователям");
	
	Если ЗначениеЗаполнено(СоглашениеСКлиентом) Тогда
		ИспользоватьОграниченияПоСоглашениям         = ПолучитьФункциональнуюОпцию("ИспользоватьОграниченияРучныхСкидокВПродажахПоСоглашениям");
	Иначе
		ИспользоватьОграниченияПоСоглашениям = Ложь;
	КонецЕсли;

	ОграничиватьРучныеСкидки                     = ИспользоватьРучныеСкидки И (ИспользоватьОграниченияРучныхСкидокВПродажах ИЛИ ИспользоватьОграниченияПоСоглашениям);

	МассивПроверок = Новый Массив;

	Если ОграничиватьРучныеСкидки Тогда
		Если ИспользоватьОграниченияРучныхСкидокВПродажах Тогда
			МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокГруппыПользователей");
			МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамПользователей");
			МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамИПользователям");
		КонецЕсли;
		МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОбщиеОграничения");
		МассивПроверок.Добавить("ВременнаяТаблицаОграниченияРучныхСкидок");
		МассивПроверок.Добавить("ОграниченияРучныхСкидокНаценок");
	Иначе
		Возврат Неопределено;
	КонецЕсли;

	ТекстЗапроса     = "";
	Для Каждого ТекЭлемент Из МассивПроверок Цикл

		Если  ТекЭлемент = "ВременнаяТаблицаОграничениеРучныхСкидокГруппыПользователей" Тогда
			
			СформироватьЗапросВременнаяТаблицаОграничениеРучныхСкидокГруппыПользователей(ТекстЗапроса);
			
		ИначеЕсли  ТекЭлемент = "ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамПользователей" Тогда
			
			СформироватьЗапросВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамПользователей(ТекстЗапроса, ИспользоватьЦеновыеГруппы);
			
		ИначеЕсли  ТекЭлемент = "ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамИПользователям" Тогда
			
			СформироватьЗапросВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамИПользователям(ТекстЗапроса, ИспользоватьЦеновыеГруппы);
			
		ИначеЕсли  ТекЭлемент = "ВременнаяТаблицаОграничениеРучныхСкидокОбщиеОграничения" Тогда
			
			СформироватьЗапросВременнаяТаблицаОграничениеРучныхСкидокОбщиеОграничения(ТекстЗапроса, ИспользоватьЦеновыеГруппы, ИспользоватьОграниченияРучныхСкидокВПродажах, ИспользоватьОграниченияПоСоглашениям);
			
		ИначеЕсли  ТекЭлемент = "ВременнаяТаблицаОграниченияРучныхСкидок" Тогда
			
			СформироватьЗапросВременнаяТаблицаОграниченияРучныхСкидок(ТекстЗапроса);
			
		ИначеЕсли ТекЭлемент = "ОграниченияРучныхСкидокНаценок" Тогда
			
			СформироватьЗапросОграниченияРучныхСкидокНаценок(ТекстЗапроса);
			
		КонецЕсли;

	КонецЦикла;

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Если ИспользоватьОграниченияПоСоглашениям Тогда
		Запрос.УстановитьПараметр("СоглашениеСКлиентом", СоглашениеСКлиентом);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Сформировать запрос временная таблица ограничение ручных скидок группы пользователей.
//
// Параметры:
//  ТекстЗапроса - Строка - Текст запроса.
//
Процедура СформироватьЗапросВременнаяТаблицаОграничениеРучныхСкидокГруппыПользователей(ТекстЗапроса) Экспорт
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыПользователейСостав.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВременнаяТаблицаОграничениеРучныхСкидокГруппыПользователей
	|ИЗ
	|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|ГДЕ
	|	ГруппыПользователейСостав.Пользователь = &Пользователь
	|;
	|";
	
КонецПроцедуры

// Сформировать запрос временная таблица ограничение ручных скидок ограничения по группам пользователей.
//
// Параметры:
//  ТекстЗапроса - Строка - Текст запроса
//  ИспользоватьЦеновыеГруппы - Булево - Признак использования ценовых групп.
//
Процедура СформироватьЗапросВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамПользователей(ТекстЗапроса, ИспользоватьЦеновыеГруппы) Экспорт
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	ВременнаяТаблицаОграничениеРучныхСкидокГруппыПользователей.Ссылка КАК ГруппаПользователей,
	|	ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)                   КАК ЦеноваяГруппа,
	|	НастройкиПродажДляПользователей.ПроцентРучнойСкидки               КАК ПроцентРучнойСкидки,
	|	НастройкиПродажДляПользователей.ПроцентРучнойНаценки              КАК ПроцентРучнойНаценки
	|ПОМЕСТИТЬ ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамПользователей
	|ИЗ
	|	ВременнаяТаблицаОграничениеРучныхСкидокГруппыПользователей КАК ВременнаяТаблицаОграничениеРучныхСкидокГруппыПользователей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиПродажДляПользователей КАК НастройкиПродажДляПользователей
	|		ПО ВременнаяТаблицаОграничениеРучныхСкидокГруппыПользователей.Ссылка = НастройкиПродажДляПользователей.Владелец
	|		И НастройкиПродажДляПользователей.ОграничиватьРучныеСкидки
	|";
	
	Если ИспользоватьЦеновыеГруппы Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаОграничениеРучныхСкидокГруппыПользователей.Ссылка КАК ГруппаПользователей,
		|	НастройкиПродажДляПользователейЦеновыеГруппы.ЦеноваяГруппа        КАК ЦеноваяГруппа,
		|	НастройкиПродажДляПользователейЦеновыеГруппы.ПроцентРучнойСкидки  КАК ПроцентРучнойСкидки,
		|	НастройкиПродажДляПользователейЦеновыеГруппы.ПроцентРучнойНаценки КАК ПроцентРучнойНаценки
		|ИЗ
		|	ВременнаяТаблицаОграничениеРучныхСкидокГруппыПользователей КАК ВременнаяТаблицаОграничениеРучныхСкидокГруппыПользователей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиПродажДляПользователей.ЦеновыеГруппы КАК НастройкиПродажДляПользователейЦеновыеГруппы
		|		ПО ВременнаяТаблицаОграничениеРучныхСкидокГруппыПользователей.Ссылка = НастройкиПродажДляПользователейЦеновыеГруппы.Ссылка.Владелец
		|		И НастройкиПродажДляПользователейЦеновыеГруппы.Ссылка.ОграничиватьРучныеСкидки
		|";

	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|;";
	
КонецПроцедуры

// Сформировать запрос временная таблица ограничение ручных скидок ограничения по группам и пользователям.
//
// Параметры:
//  ТекстЗапроса - Строка - Текст запроса
//  ИспользоватьЦеновыеГруппы - Булево - Признак использования ценовых групп.
//
Процедура СформироватьЗапросВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамИПользователям(ТекстЗапроса, ИспользоватьЦеновыеГруппы) Экспорт
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	2                                                                                                       КАК Приоритет,
	|	ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамПользователей.ЦеноваяГруппа                  КАК ЦеноваяГруппа,
	|	МАКСИМУМ(ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамПользователей.ПроцентРучнойСкидки)  КАК ПроцентРучнойСкидки,
	|	МАКСИМУМ(ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамПользователей.ПроцентРучнойНаценки) КАК ПроцентРучнойНаценки
	|ПОМЕСТИТЬ ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамИПользователям
	|ИЗ
	|	ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамПользователей КАК ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамПользователей
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамПользователей.ЦеноваяГруппа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1                                                    КАК Приоритет,
	|	ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)      КАК ЦеноваяГруппа,
	|	НастройкиПродажДляПользователей.ПроцентРучнойСкидки  КАК ПроцентРучнойСкидки,
	|	НастройкиПродажДляПользователей.ПроцентРучнойНаценки КАК ПроцентРучнойНаценки
	|ИЗ
	|	Справочник.НастройкиПродажДляПользователей КАК НастройкиПродажДляПользователей
	|ГДЕ
	|	НастройкиПродажДляПользователей.Владелец = &Пользователь
	|	И НастройкиПродажДляПользователей.ОграничиватьРучныеСкидки
	|";
	
	Если ИспользоватьЦеновыеГруппы Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	1                                                                 КАК Приоритет,
		|	НастройкиПродажДляПользователейЦеновыеГруппы.ЦеноваяГруппа КАК    ЦеноваяГруппа,
		|	НастройкиПродажДляПользователейЦеновыеГруппы.ПроцентРучнойСкидки  КАК ПроцентРучнойСкидки,
		|	НастройкиПродажДляПользователейЦеновыеГруппы.ПроцентРучнойНаценки КАК ПроцентРучнойНаценки
		|ИЗ
		|	Справочник.НастройкиПродажДляПользователей.ЦеновыеГруппы КАК НастройкиПродажДляПользователейЦеновыеГруппы
		|ГДЕ
		|	НастройкиПродажДляПользователейЦеновыеГруппы.Ссылка.Владелец = &Пользователь
		|	И НастройкиПродажДляПользователейЦеновыеГруппы.Ссылка.ОграничиватьРучныеСкидки
		|";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|;";
	
КонецПроцедуры

// Сформировать запрос временная таблица ограничение ручных скидок общие ограничения.
//
// Параметры:
//  ТекстЗапроса - Строка - Текст запроса
//  ИспользоватьЦеновыеГруппы - Булево - Признак использования ценовых групп.
//  ИспользоватьОграниченияПоПользователям - Булево - Признак использования ограничений по пользователям.
//  ИспользоватьОграниченияПоСоглашениям - Булево - Признак использования ограничений по соглашениям.
//
Процедура СформироватьЗапросВременнаяТаблицаОграничениеРучныхСкидокОбщиеОграничения(ТекстЗапроса, ИспользоватьЦеновыеГруппы, ИспользоватьОграниченияПоПользователям, ИспользоватьОграниченияПоСоглашениям) Экспорт
	
	ИмяВременнойТаблицы = "ВременнаяТаблицаОграничениеРучныхСкидокОбщиеОграничения";
	Если ИспользоватьОграниченияПоПользователям Тогда
		
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ
		|	ЦеновыеГруппы.Ссылка КАК Ссылка,
		|	0.00                 КАК ПроцентРучнойСкидки,
		|	0.00                 КАК ПроцентРучнойНаценки
		|ПОМЕСТИТЬ ЦеновыеГруппы
		|ИЗ
		|	Справочник.ЦеновыеГруппы КАК ЦеновыеГруппы
		|	
		|ОБЪЕДИНИТЬ ВСЕ
		|			
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка),
		|	0.00 КАК ПроцентРучнойСкидки,
		|	0.00 КАК ПроцентРучнойНаценки
		|;
		|
		|///////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамИПользователям.Приоритет) КАК Приоритет,
		|	ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамИПользователям.ЦеноваяГруппа      КАК ЦеноваяГруппа
		|ПОМЕСТИТЬ ОграничениеРучныхСкидокПоГруппамИПользователям
		|ИЗ
		|	ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамИПользователям КАК ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамИПользователям
		|	
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамИПользователям.ЦеноваяГруппа
		|;
		|
		|///////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	Таблица.ЦеноваяГруппа                  КАК ЦеноваяГруппа,
		|	МАКСИМУМ(Таблица.ПроцентРучнойСкидки)  КАК ПроцентРучнойСкидки,
		|	МАКСИМУМ(Таблица.ПроцентРучнойНаценки) КАК ПроцентРучнойНаценки
		|ПОМЕСТИТЬ ТаблицаОграничений
		|ИЗ
		|	(ВЫБРАТЬ
		|		Ограничения.ЦеноваяГруппа        КАК ЦеноваяГруппа,
		|		Ограничения.ПроцентРучнойСкидки  КАК ПроцентРучнойСкидки,
		|		Ограничения.ПроцентРучнойНаценки КАК ПроцентРучнойНаценки
		|	ИЗ
		|		ОграничениеРучныхСкидокПоГруппамИПользователям
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамИПользователям КАК Ограничения
		|		ПО (Ограничения.ЦеноваяГруппа = ОграничениеРучныхСкидокПоГруппамИПользователям.ЦеноваяГруппа)
		|			И (Ограничения.Приоритет = ОграничениеРучныхСкидокПоГруппамИПользователям.Приоритет)
		|	
		//|	ОБЪЕДИНИТЬ ВСЕ
		//|	
		//|	ВЫБРАТЬ
		//|		ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка) КАК ЦеноваяГруппа,
		//|		0.00 КАК ПроцентРучнойСкидки,
		//|		0.00 КАК ПроцентРучнойНаценки
		|	
		|) КАК Таблица
		|
		|СГРУППИРОВАТЬ ПО
		|	Таблица.ЦеноваяГруппа
		|;
		|
		|///////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеновыеГруппы.Ссылка                                                                        КАК ЦеноваяГруппа,
		|	ЕСТЬNULL(ТаблицаОграничений.ПроцентРучнойСкидки,  ТаблицаОграничений0.ПроцентРучнойСкидки)  КАК ПроцентРучнойСкидки,
		|	ЕСТЬNULL(ТаблицаОграничений.ПроцентРучнойНаценки, ТаблицаОграничений0.ПроцентРучнойНаценки) КАК ПроцентРучнойНаценки
		|ПОМЕСТИТЬ " + ИмяВременнойТаблицы + "
		|ИЗ ЦеновыеГруппы
		|ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОграничений
		|ПО ТаблицаОграничений.ЦеноваяГруппа = ЦеновыеГруппы.Ссылка 
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОграничений КАК ТаблицаОграничений0
		|ПО ТаблицаОграничений0.ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)";
		
	КонецЕсли;
	
	Если ИспользоватьОграниченияПоСоглашениям Тогда
		
		Если ИспользоватьОграниченияПоПользователям Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка) КАК ЦеноваяГруппа,
		|	СоглашенияСКлиентами.ПроцентРучнойСкидки        КАК ПроцентРучнойСкидки,
		|	СоглашенияСКлиентами.ПроцентРучнойНаценки       КАК ПроцентРучнойНаценки";
		
		Если Не ИспользоватьОграниченияПоПользователям Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|ПОМЕСТИТЬ " + ИмяВременнойТаблицы;
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|ИЗ
		|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
		|ГДЕ
		|	СоглашенияСКлиентами.Ссылка = &СоглашениеСКлиентом
		|	И СоглашенияСКлиентами.ОграничиватьРучныеСкидки
		|";
		
		Если ИспользоватьЦеновыеГруппы Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СправочникЦеновыеГруппы.Ссылка                  КАК ЦеноваяГруппа,
			|	СоглашенияСКлиентами.ПроцентРучнойСкидки        КАК ПроцентРучнойСкидки,
			|	СоглашенияСКлиентами.ПроцентРучнойНаценки       КАК ПроцентРучнойНаценки
			|ИЗ
			|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦеновыеГруппы КАК СправочникЦеновыеГруппы ПО ИСТИНА
			|ГДЕ
			|	СоглашенияСКлиентами.Ссылка = &СоглашениеСКлиентом
			|	И СправочникЦеновыеГруппы.Ссылка НЕ В (ВЫБРАТЬ Т.ЦеноваяГруппа ИЗ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК Т ГДЕ Т.Ссылка = &СоглашениеСКлиентом И Т.Ссылка.ОграничиватьРучныеСкидки)
			|	И СоглашенияСКлиентами.ОграничиватьРучныеСкидки
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СоглашенияСКлиентамиЦеновыеГруппы.ЦеноваяГруппа        КАК ЦеноваяГруппа,
			|	СоглашенияСКлиентамиЦеновыеГруппы.ПроцентРучнойСкидки  КАК ПроцентРучнойСкидки,
			|	СоглашенияСКлиентамиЦеновыеГруппы.ПроцентРучнойНаценки КАК ПроцентРучнойНаценки
			|ИЗ
			|	Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СоглашенияСКлиентамиЦеновыеГруппы
			|ГДЕ
			|	СоглашенияСКлиентамиЦеновыеГруппы.Ссылка = &СоглашениеСКлиентом
			|	И СоглашенияСКлиентамиЦеновыеГруппы.Ссылка.ОграничиватьРучныеСкидки
			|";
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|;";
	
КонецПроцедуры

// Сформировать запрос временная таблица ограничения ручных скидок.
//
// Параметры:
//  ТекстЗапроса - Строка - Текст запроса.
//
Процедура СформироватьЗапросВременнаяТаблицаОграниченияРучныхСкидок(ТекстЗапроса) Экспорт
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	ВременнаяТаблицаОграничениеРучныхСкидокОбщиеОграничения.ЦеноваяГруппа,
	|	МИНИМУМ(ВременнаяТаблицаОграничениеРучныхСкидокОбщиеОграничения.ПроцентРучнойНаценки) КАК ПроцентРучнойНаценки,
	|	МИНИМУМ(ВременнаяТаблицаОграничениеРучныхСкидокОбщиеОграничения.ПроцентРучнойСкидки) КАК ПроцентРучнойСкидки
	|ПОМЕСТИТЬ ВременнаяТаблицаОграниченияРучныхСкидок
	|ИЗ
	|	ВременнаяТаблицаОграничениеРучныхСкидокОбщиеОграничения КАК ВременнаяТаблицаОграничениеРучныхСкидокОбщиеОграничения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаОграничениеРучныхСкидокОбщиеОграничения.ЦеноваяГруппа
	|;
	|";
	
КонецПроцедуры

// Получить права доступа РМК для пользователя.
//
// Параметры:
//  Пользователь - СправочникСсылка - Пользователь.
// 
// Возвращаемое значение:
//  Структура - Права доступа пользователя.
//
Функция ПраваДоступаРМК(Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПраваДоступа = ПраваДоступаПоУмолчанию();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	2 КАК Приоритет,
	|	НастройкиПродажДляПользователей.Ссылка КАК Ссылка,
	|	НастройкиПродажДляПользователей.РМК_Отложить КАК Отложить,
	|	НастройкиПродажДляПользователей.РМК_Зарезервировать КАК Зарезервировать,
	|	НастройкиПродажДляПользователей.РМК_ВыемкаДенег КАК ВыемкаДенег,
	|	НастройкиПродажДляПользователей.РМК_ВнесениеДенег КАК ВнесениеДенег,
	|	НастройкиПродажДляПользователей.РМК_ОткрытьСмену КАК ОткрытьСмену,
	|	НастройкиПродажДляПользователей.РМК_ЗакрытьСмену КАК ЗакрытьСмену,
	|	НастройкиПродажДляПользователей.РМК_ВозвратТовара КАК ВозвратТовара,
	|	НастройкиПродажДляПользователей.РМК_КорректировкаСтрок КАК КорректировкаСтрок,
	|	НастройкиПродажДляПользователей.РМК_ИзменениеКартЛояльности КАК ИзменениеКартЛояльности,
	|	НастройкиПродажДляПользователей.РМК_РедактированиеИнформацииОКлиенте КАК РедактированиеИнформацииОКлиенте
	|ПОМЕСТИТЬ Настройки
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Ссылка КАК Ссылка
	|	ИЗ
	|		Справочник.ГруппыПользователей.Состав КАК Т
	|	ГДЕ
	|		Т.Пользователь = &Пользователь) КАК ГруппыПользователей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиПродажДляПользователей КАК НастройкиПродажДляПользователей
	|		ПО ГруппыПользователей.Ссылка = НастройкиПродажДляПользователей.Владелец
	|ГДЕ
	|	НастройкиПродажДляПользователей.РМК_Использовать
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	НастройкиПродажДляПользователей.Ссылка,
	|	НастройкиПродажДляПользователей.РМК_Отложить,
	|	НастройкиПродажДляПользователей.РМК_Зарезервировать,
	|	НастройкиПродажДляПользователей.РМК_ВыемкаДенег,
	|	НастройкиПродажДляПользователей.РМК_ВнесениеДенег,
	|	НастройкиПродажДляПользователей.РМК_ОткрытьСмену,
	|	НастройкиПродажДляПользователей.РМК_ЗакрытьСмену,
	|	НастройкиПродажДляПользователей.РМК_ВозвратТовара,
	|	НастройкиПродажДляПользователей.РМК_КорректировкаСтрок,
	|	НастройкиПродажДляПользователей.РМК_ИзменениеКартЛояльности,
	|	НастройкиПродажДляПользователей.РМК_РедактированиеИнформацииОКлиенте
	|ИЗ
	|	Справочник.НастройкиПродажДляПользователей КАК НастройкиПродажДляПользователей
	|ГДЕ
	|	НастройкиПродажДляПользователей.Владелец = &Пользователь
	|	И НастройкиПродажДляПользователей.РМК_Использовать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Настройки.Приоритет КАК Приоритет,
	|	МАКСИМУМ(Настройки.Отложить) КАК Отложить,
	|	МАКСИМУМ(Настройки.Зарезервировать) КАК Зарезервировать,
	|	МАКСИМУМ(Настройки.ВыемкаДенег) КАК ВыемкаДенег,
	|	МАКСИМУМ(Настройки.ВнесениеДенег) КАК ВнесениеДенег,
	|	МАКСИМУМ(Настройки.ОткрытьСмену) КАК ОткрытьСмену,
	|	МАКСИМУМ(Настройки.ЗакрытьСмену) КАК ЗакрытьСмену,
	|	МАКСИМУМ(Настройки.ВозвратТовара) КАК ВозвратТовара,
	|	МАКСИМУМ(Настройки.КорректировкаСтрок) КАК КорректировкаСтрок,
	|	МАКСИМУМ(Настройки.ИзменениеКартЛояльности) КАК ИзменениеКартЛояльности,
	|	МАКСИМУМ(Настройки.РедактированиеИнформацииОКлиенте) КАК РедактированиеИнформацииОКлиенте
	|ИЗ
	|	Настройки КАК Настройки
	|
	|СГРУППИРОВАТЬ ПО
	|	Настройки.Приоритет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет");
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПраваДоступа, Выборка);
	КонецЕсли;
	
	Возврат ПраваДоступа;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьЗапросОграниченияРучныхСкидокНаценок(ТекстЗапроса)
	
	ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	ВременнаяТаблицаОграниченияРучныхСкидок.ЦеноваяГруппа        КАК ЦеноваяГруппа,
		|	ВременнаяТаблицаОграниченияРучныхСкидок.ПроцентРучнойСкидки  КАК МаксимальныйПроцентРучнойСкидки,
		|	ВременнаяТаблицаОграниченияРучныхСкидок.ПроцентРучнойНаценки КАК МаксимальныйПроцентРучнойНаценки
		|ИЗ
		|	ВременнаяТаблицаОграниченияРучныхСкидок КАК ВременнаяТаблицаОграниченияРучныхСкидок
		|";
	
КонецПроцедуры

Функция ПраваДоступаПоУмолчанию()
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ЗначениеПоУмолчанию = Истина;
	
	ВозвращаемоеЗначение.Вставить("Отложить",        ЗначениеПоУмолчанию);
	ВозвращаемоеЗначение.Вставить("Зарезервировать", ЗначениеПоУмолчанию);
	
	ВозвращаемоеЗначение.Вставить("ВыемкаДенег",   ЗначениеПоУмолчанию);
	ВозвращаемоеЗначение.Вставить("ВнесениеДенег", ЗначениеПоУмолчанию);
	
	ВозвращаемоеЗначение.Вставить("ОткрытьСмену", ЗначениеПоУмолчанию);
	ВозвращаемоеЗначение.Вставить("ЗакрытьСмену", ЗначениеПоУмолчанию);
	
	ВозвращаемоеЗначение.Вставить("ВозвратТовара", ЗначениеПоУмолчанию);
	
	ВозвращаемоеЗначение.Вставить("КорректировкаСтрок",      ЗначениеПоУмолчанию);
	ВозвращаемоеЗначение.Вставить("ИзменениеКартЛояльности", ЗначениеПоУмолчанию);
	ВозвращаемоеЗначение.Вставить("РедактированиеИнформацииОКлиенте", ЗначениеПоУмолчанию);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти
